"""
Варіант 8

Задача №2: Підведіть підсумки виборів: для кожного з учасника голосування визначте число відданих за нього голосів. Кожен рядок вхідного файлу містить прізвище кандидата, за якого віддають голоси виборці цього штату, потім через пропуск йде кількість голосів, які віддали за цього кандидата. Виведіть прізвища всіх кандидатів в лексикографічному порядку, потім, через пропуск, кількість відданих за них голосів.
Автор: Гладкович Ярослав
"""

# Вказуємо шлях до файлу
file_path = r'C:\Users\User\Desktop\votes.txt'

# Відкриваємо файл для читання
with open(file_path, 'r') as file:
    # Зчитуємо дані з файлу
    data = file.readlines()

# Створюємо словник для збереження кількості голосів для кожного кандидата
votes = {}
for line in data:
    # Розбиваємо рядок на ім'я кандидата та кількість голосів
    name, count = line.split()
    if name in votes:
        # Якщо ім'я вже є в словнику, додаємо кількість голосів до відповідного кандидата
        votes[name] += int(count)
    else:
        # Якщо ім'я не зустрічалося раніше, додаємо нового кандидата до словника з відповідною кількістю голосів
        votes[name] = int(count)

# Сортуємо список кандидатів за алфавітом
sorted_candidates = sorted(votes.keys())

# Виводимо результати
for candidate in sorted_candidates:
    print(candidate, votes[candidate])