"""
Варіант 8

Задача №1: Напишіть функцію, яка перевіряє, чи рядок є паліндром чи ні. Регістр літер, пропуски і знаки пунктуації не враховувати

Автор: Гладкович Ярослав
"""
# Функція для перевірки, чи рядок є паліндромом
def is_palindrome(s):
    # Видаляємо всі символи, крім літер та цифр і змінюємо регістр на нижній
    s = ''.join(e for e in s if e.isalnum()).lower()
    # Перевіряємо, чи отриманий рядок дорівнює своєму реверсу
    return s == s[::-1]

# Запит у користувача на введення рядка
s = input("Введіть рядок: ")
# Виводимо результат перевірки на паліндром
print(is_palindrome(s))